[
  {
    "title": "Misleading Description & Poor Quality – 'Carolyn Knight' Bare Root Rose",
    "body": "I ordered the Carolyn Knight bare root rose believing in David Austin’s long-standing promise of Grade #1 quality, which clearly states that English shrub roses should have a minimum of three strong, well-ripened canes. What I received was one single strong cane and possibly one very weak secondary cane – completely below what is advertised.\n\nWhat’s more disappointing is that the bare root rose arrived without any label, and the size and structure are much smaller and weaker than what’s shown on their website or expected from a premium supplier.\n\nTheir customer service replied that varieties with an “open or arching habit” may be sent with only two canes “on occasion” – but this is not reflected anywhere in their public product information. This type of inconsistent explanation sounds more like an excuse to cover poor grading or careless dispatch. If this is truly the case for ‘Carolyn Knight’, then they should update the website photos and product descriptions immediately to show realistic, accurate expectations of what customers will receive — not a healthy, full three-cane bare root as pictured.\n\nI’ve spent years building a front garden focused entirely on David Austin roses, and have recommended them many times over other brands. Sadly, this experience raises serious doubts about their current quality control and honesty in customer communication.\n\nDavid Austin is a respected name — but one misleading order like this can damage the trust of loyal customers forever.",
    "rating": 1,
    "review_date": "2025-04-17 22:09:19 UTC",
    "source": "web",
    "curated": "ok",
    "product_id": "4113818026065",
    "product_handle": "carolyn-knight",
    "reply": "",
    "reply_date": "",
    "picture_urls": "https://s3.amazonaws.com/me.judge.review-images/david-austin-roses-uk/1744927760__davidaustincarolynknight1__original.jpg, https://s3.amazonaws.com/me.judge.review-images/david-austin-roses-uk/1744927761__davidaustincarolynknight2__original.jpg, https://s3.amazonaws.com/me.judge.review-images/david-austin-roses-uk/1744927762__2025davidaustincustomerservicesreplies__original.png, https://s3.amazonaws.com/me.judge.review-images/david-austin-roses-uk/1744927764__2025aprildavidaustincomplaint1__original.png",
    "ip_address": "2.216.15.179",
    "location": "Derby, England, United Kingdom",
    "metaobject_handle": "review-ef31054d-71d1-4603-89db-cfe54b8fc7e7"
  },
  {
    "title": "Exceeded Expectations – Stunning Rose with Exceptional Fragrance!",
    "body": "I purchased a bare root “Carolyn Knight” rose last autumn, and it has far exceeded my expectations. It has grown into a strong, upright plant with lush, deep green foliage that looks incredibly healthy and vibrant. But the real star is the bloom – absolutely breathtaking! The colors are even more striking than depicted on the website, with captivating hues of orange, yellow, and apricot that create a stunning display.\nAnd the fragrance – simply exquisite! It’s rich, warm, and utterly delightful, filling the garden with a scent that’s both nostalgic and refreshing. I couldn’t be more thrilled with how beautifully it has flourished. Highly recommend to any rose enthusiast!",
    "rating": 5,
    "review_date": "2025-05-17 08:14:24 UTC",
    "source": "web",
    "curated": "ok",
    "product_id": "4113818026065",
    "product_handle": "carolyn-knight",
    "reply": "",
    "reply_date": "",
    "picture_urls": "https://s3.amazonaws.com/me.judge.review-images/david-austin-roses-uk/1747469679__img_4148__original.jpeg, https://s3.amazonaws.com/me.judge.review-images/david-austin-roses-uk/1747469664__img_4146__original.jpeg, https://s3.amazonaws.com/me.judge.review-images/david-austin-roses-uk/1747469670__img_4147__original.jpeg, https://s3.amazonaws.com/me.judge.review-images/david-austin-roses-uk/1747469675__img_4144__original.jpeg",
    "ip_address": "140.248.40.41",
    "location": "Croydon, England, United Kingdom",
    "metaobject_handle": "review-3a90d50e-5841-4f59-b761-e6a26bb3f18a"
  },
  {
    "title": "Floppy flowers",
    "body": "This rose has a beautiful colour, however due to the blooms being too heavy the stems are unable to support them and the flowers are bent down making them look quite unattractive. Wish I'd known this before I purchased this variety.",
    "rating": 2,
    "review_date": "2025-06-10 08:11:43 UTC",
    "source": "web",
    "curated": "ok",
    "product_id": "4113818026065",
    "product_handle": "carolyn-knight",
    "reply": "",
    "reply_date": "",
    "picture_urls": "",
    "ip_address": "134.231.184.78",
    "location": "London, England, United Kingdom",
    "metaobject_handle": "review-9dcf95c3-2089-4cc2-8cfb-bb60ce9dbd0c"
  }
]