[
  {
    "title": "Beautiful Blooms",
    "body": "This rose was given as a gift 6 years ago.  It has been an absolute delight with beautiful, fragranced flowers.  It is planted in my sunny garden border and is pruned each year and just keeps going from strength to strength.  We have looked forward to it’s amazing blooms each year and it has not disappointed.",
    "rating": 5,
    "review_date": "2025-05-21 19:47:56 UTC",
    "source": "web",
    "curated": "ok",
    "product_id": "4113811046481",
    "product_handle": "the-ancient-mariner",
    "reply": "",
    "reply_date": "",
    "picture_urls": "https://s3.amazonaws.com/me.judge.review-images/david-austin-roses-uk/1747856876__0d9000b6-9149-4e83-8b5f-a9df75957c42__original.jpeg",
    "ip_address": "94.1.33.31",
    "location": "Sheffield, England, United Kingdom",
    "metaobject_handle": "review-1fd9d052-3e8a-458b-a4ee-3fee0dd3e2c0"
  },
  {
    "title": "Stunning Shrub Rose",
    "body": "I am so pleased with my first DA Rose\nPurchase … I bought as a plant and kept in a pot last summer for its first year feeding it with organic seaweed weekly during the summer. I had about 10 flowers (cool pale pink) on dark green glossy foliage. In Oct 24 I transferred to a south facing (clay-ish) border about 1.5m in and it tripled in size this spring and the first flush was  in early June stunning … double the blooms of the previous season. It just needed a bit of support as the foliage is quite immature to hold the huge blooms … which I am sure with strength over time.  We are end of 1st week in July and we have more new foliage and more buds forming up.     So very pleased …. That I have gone on to buy 8 more  DA roses - a mix of bare roots and plants … and I love Desdemona that I am learning about this season.   Just watching them like a hawk with our hot season 2025  here in UK.  P all roses recieved sustained release granulesi. March and end of June with organic seaweed liquid feeds weekly from end of April.",
    "rating": 5,
    "review_date": "2025-07-06 08:39:54 UTC",
    "source": "web",
    "curated": "ok",
    "product_id": "4113811046481",
    "product_handle": "the-ancient-mariner",
    "reply": "",
    "reply_date": "",
    "picture_urls": "",
    "ip_address": "82.2.58.42",
    "location": "Nottingham, England, United Kingdom",
    "metaobject_handle": "review-45cfda67-55cb-45ef-9c8f-7602777015e7"
  }
]