[
  {
    "title": "Fantastic Rose for a large pot.",
    "body": "I’ve got 2 Vanessa Bell roses growing in 2 large pot, and they have been absolutely lovely. The buds open with a soft blush of pink and turn into elegant, medium-sized cups in generous clusters. The colour is gentle and cheerful—pale yellow fading to white at the edges, with a rich yellow centre that glows, especially in the early morning light.\n\nThe fragrance is one of the best things about it—fresh and slightly unusual, like green tea with a bit of lemon and honey. It’s subtle but noticeable, especially when the sun’s been on it for a bit.\n\nEven in a container, it’s grown into a tidy, upright shrub with a nice full shape. It’s stayed healthy and blooms reliably, which is always a bonus when growing in pots.\n\nI also really like that it’s named after Vanessa Bell, the artist and sister of Virginia Woolf—it adds a bit of character and history to the garden, which I appreciate.\n\nAll in all, a beautifully scented, easy-to-care-for rose that looks stunning in a container. I’d definitely recommend it to anyone short on space or wanting to brighten up a patio or balcony.",
    "rating": 5,
    "review_date": "2025-04-10 17:08:30 UTC",
    "source": "web",
    "curated": "ok",
    "product_id": "4114020073553",
    "product_handle": "vanessa-bell",
    "reply": "",
    "reply_date": "",
    "picture_urls": "https://s3.amazonaws.com/me.judge.review-images/david-austin-roses-uk/1744304910__img_8248__original.jpeg",
    "ip_address": "35.176.71.72",
    "location": "London, England, United Kingdom",
    "metaobject_handle": "review-d31c2396-57e2-472d-97df-f873fe741f4f"
  },
  {
    "title": "",
    "body": "Beautiful bushy potted plant - purchased in April. It has buds on already!",
    "rating": 5,
    "review_date": "2025-04-26 19:05:20 UTC",
    "source": "shop-app",
    "curated": "ok",
    "product_id": "4114020073553",
    "product_handle": "vanessa-bell",
    "reply": "",
    "reply_date": "",
    "picture_urls": "",
    "ip_address": "",
    "location": "",
    "metaobject_handle": "shop-2519111-206366997-c1bcfdde-5d31-4345-9402-28fa3b9ac241"
  },
  {
    "title": "Absolutely beautiful,  v well packed",
    "body": "Sometimes I am tempted to order a rose from another supplier.  But then, when I get my delivery, I remember why I order from David Austin each time. \n\nThis is my 6th investment from D.A. \n\nThe packaging is all recyclable/ compostable. So well packaged. Peat free. Hardly any compost spill. This is so important in this day and age. My rose looks amazing out of the box.  Already covered in buds. Instant impact.  It has had the best start. \n\nI cannot wait to see this grow. I know it will get better each year, as have my other roses from you.",
    "rating": 5,
    "review_date": "2025-04-28 08:10:00 UTC",
    "source": "web",
    "curated": "ok",
    "product_id": "4114020073553",
    "product_handle": "vanessa-bell",
    "reply": "",
    "reply_date": "",
    "picture_urls": "https://s3.amazonaws.com/me.judge.review-images/david-austin-roses-uk/1745827800__20250426_161210__original.jpg, https://s3.amazonaws.com/me.judge.review-images/david-austin-roses-uk/1745827802__20250426_160655__original.jpg",
    "ip_address": "185.237.62.33",
    "location": "Newham, England, United Kingdom",
    "metaobject_handle": "review-359e5415-06d6-40ce-b0c2-c06e0eae75df"
  },
  {
    "title": "Beautiful Rose, Terrible Delivery",
    "body": "My issue with this order was not with the rose itself. It is a beautiful, healthy plant and exactly what I was expecting. My issue, unfortunately, was the terrible service provided by the courier, APC Delivery.\nI first received an email telling me my rose was scheduled for delivery on the 30th of May. The day came and went with no updates and no rose. The delivery was delayed multiple times until it was finally “delivered” yesterday, the 4th of June. Naturally, I was worried about the condition the rose would be in, having been rattled around in a van for the best part of a week.\nThe delivery window yesterday again came and went and though the tracking showed the driver was nearby, it was almost an hour after the delivery slot that I received an email saying my rose had been delivered. However, it said the rose had been left in a safe place, the Back Door, as instructed. I made no such instruction, as we don’t have a back door accessible from the street. It then transpired that it had been delivered to an entirely different house on an entirely different road. This is baffling to me, as the address was correct and clearly printed on the box. I then had to go out looking for the house the rose had gone to, trying to match the delivery photo and map location. I had to go into someone else’s front garden, up to their door to get the box, all the while worried that someone would come out and accuse me of stealing their post.\nThis is hands down the absolute worst delivery experience I’ve ever had and unfortunately would definitely make me think twice about ordering from David Austin again. It’s such a shame, as when I eventually got the rose it was beautiful (despite being a little battered and bruised from being in a van for days) and my issues are nothing to do with David Austin themselves. I would really urge you to rethink using this carrier if this is in any way a common issue, as it really ruins the experience of buying such top quality plants from a great nursery.\nI’m glad I have such a beautiful rose now, but I almost definitely would shop elsewhere for any more after such a frustrating and sloppy delivery service.",
    "rating": 3,
    "review_date": "2025-06-05 14:21:33 UTC",
    "source": "new-rre-flow",
    "curated": "ok",
    "product_id": "4114020073553",
    "product_handle": "vanessa-bell",
    "reply": "",
    "reply_date": "",
    "picture_urls": "",
    "ip_address": "80.2.89.176",
    "location": "Fulham, England, United Kingdom",
    "metaobject_handle": "review-6a0e4b14-5608-4582-822d-5d6cdd50019c"
  },
  {
    "title": "Beautiful Rose",
    "body": "I am very pleased with the healthy bushy plant, excellent packaging and delivery (end of May 2025). However, puzzled why there is no scent, not even on new flowers in the morning. Roald Dahl by comparison is much stronger scented.",
    "rating": 5,
    "review_date": "2025-06-18 18:42:20 UTC",
    "source": "web",
    "curated": "ok",
    "product_id": "4114020073553",
    "product_handle": "vanessa-bell",
    "reply": "",
    "reply_date": "",
    "picture_urls": "https://s3.amazonaws.com/me.judge.review-images/david-austin-roses-uk/1750272141__img_4553__original.jpeg",
    "ip_address": "",
    "location": "",
    "metaobject_handle": "review-cecbb436-aaab-4e03-a39a-d4eabe85478d"
  }
]